# [ 정렬(sort) ]-----------------------------------------------

- 데이터 정렬
- 기준
    - 인덱스 => sort_index()
    - 값 => sort_value()

In [41]:
# 모듈 로딩
import pandas as pd
import numpy as np   # nan 사용을 위함.

# 데이터 생성
df=pd.DataFrame({'value':[4,1,2,3,5],
                 'name' :['John Kim','GilDong Hong','Tom','Lee','Annan jung'],
                 'age'  :[12, np.nan, 10, 6, np.nan]})

# 데이터 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   name    5 non-null      object
 2   age     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [42]:
# 인덱스 & 컬럼 확인

print(df.index, df.columns, sep='\n')

RangeIndex(start=0, stop=5, step=1)
Index(['value', 'name', 'age'], dtype='object')

In [43]:
# 정렬하기
# [기본] 오름차순 -> ascending 파라미터 = False : 내림차순 정렬

df.sort_index(ascending =False)

   value          name   age
4      5    Annan jung   NaN
3      3           Lee   6.0
2      2           Tom  10.0
1      1  GilDong Hong   NaN
0      4      John Kim  12.0

In [44]:
# 특정 컬럼 기준 정렬 => sort_value()

# name 컬럼으로 정렬
df.sort_values(by='name', ascending=False)

   value          name   age
2      2           Tom  10.0
3      3           Lee   6.0
0      4      John Kim  12.0
1      1  GilDong Hong   NaN
4      5    Annan jung   NaN

In [45]:
df.name[0],len(df.name[0])

('John Kim', 8)

In [46]:
# name 컬럼의 각 요소의 길이
[len(name) for name in df['name']]

[8, 12, 3, 3, 10]

In [61]:
# (실습) name 길이로 정렬하기 : key 활용
df.sort_values(by='name', key=lambda x: x.str.len())

   value          name   age
2      2           Tom  10.0
3      3           Lee   6.0
0      4      John Kim  12.0
4      5    Annan jung   NaN
1      1  GilDong Hong   NaN

# 컬럼명 정렬----------------------------------------------

In [48]:
df.columns , type(df.columns), list(df.columns)

(Index(['value', 'name', 'age'], dtype='object'),
 pandas.core.indexes.base.Index,
 ['value', 'name', 'age'])

In [49]:
colList= list(df.columns)
colList

['value', 'name', 'age']

In [50]:
colList.sort()
colList

['age', 'name', 'value']

In [51]:
df2=df[colList]
df2

    age          name  value
0  12.0      John Kim      4
1   NaN  GilDong Hong      1
2  10.0           Tom      2
3   6.0           Lee      3
4   NaN    Annan jung      5

In [52]:
df3=df.T
df3

              0             1     2    3           4
value         4             1     2    3           5
name   John Kim  GilDong Hong   Tom  Lee  Annan jung
age        12.0           NaN  10.0  6.0         NaN

In [53]:
df3.reset_index(inplace=True)
df3

   index         0             1     2    3           4
0  value         4             1     2    3           5
1   name  John Kim  GilDong Hong   Tom  Lee  Annan jung
2    age      12.0           NaN  10.0  6.0         NaN

In [54]:
df3.sort_values(by='index')

   index         0             1     2    3           4
2    age      12.0           NaN  10.0  6.0         NaN
1   name  John Kim  GilDong Hong   Tom  Lee  Annan jung
0  value         4             1     2    3           5

In [55]:
df3.set_index('index',inplace=True)
df3

              0             1     2    3           4
index
value         4             1     2    3           5
name   John Kim  GilDong Hong   Tom  Lee  Annan jung
age        12.0           NaN  10.0  6.0         NaN

In [57]:
df4 = df3.T
df4

index value          name   age
0         4      John Kim  12.0
1         1  GilDong Hong   NaN
2         2           Tom  10.0
3         3           Lee   6.0
4         5    Annan jung   NaN